app/controllers/books_controller.rb

INSERT INTO "books" ("title", "number_of_pages", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Yuru Camp"], ["number_of_pages", 20], ["created_at", "2021-12-07 07:44:12.569379"], ["updated_at", "2021-12-07 07:44:12.569379"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2021-12-07 07:44:12.720580"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)